export interface SchoolBookToOpen {
  name: string
  authors: string[]
  path: string
  image?: string
}

export const schoolBooks2Form: SchoolBookToOpen[] = [
  {
    name: 'Математика',
    image: 'Математика.jpg',
    authors: ['С. Скворцова', 'О.Онопрієнко'],
    path: 'Математика 2 клас С. Скворцова, О.Онопрієнко.pdf',
  },
  {
    name: 'Інформатика ЯДС (2 частина)',
    image: 'Інформатика.png',
    authors: ['Наталія Морзе', 'Ольга Барна'],
    path: 'Інформатика (ЯДС (2 частина)) 2 клас Наталія Морзе, Ольга Барна.pdf',
  },
  {
    name: 'Українська мова та читання (1 частина)',
    image: 'Українська мова та читання (1 частина).webp',
    authors: ['М. Вашуленко', 'С. Дубовик'],
    path: 'Українська мова та читання (1 частина) 2 клас М. Вашуленко, С. Дубовик.pdf',
  },
  {
    name: 'Українська мова та читання (2 частина)',
    image: 'Українська мова та читання (2 частина).jpg',
    authors: ['О. Вашуленко'],
    path: 'Українська мова та читання (2 частина) 2 клас О. Вашуленко.pdf',
  },
  {
    name: 'Хрестоматія сучасної української літератури 1-2 клас',
    image: 'Хрестоматія.jpg',
    authors: [],
    path: 'Хрестоматія сучасної української літератури 1-2 клас.pdf',
  },
  {
    name: 'ЯДС',
    image: 'ЯДС.webp',
    authors: ['Зоя Хитра', 'Ірина Грущинська'],
    path: 'ЯДС (1 частина) 2 клас Зоя Хитра, Ірина Грущинська.pdf',
  },
]

export const schoolBooks4Form: SchoolBookToOpen[] = [
  {
    name: 'Англійська мова',
    image: 'Англійська.jpg',
    authors: ['Карпюк'],
    path: 'Англійська мова 4 клас Карпюк.pdf',
  },
  {
    name: 'Математика',
    image: 'Математика.webp',
    authors: ['С.Скворцова', 'О.Онопрієнко'],
    path: 'Математика (2 частина) 4 клас С.Скворцова, О.Онопрієнко.pdf',
  },
  {
    name: 'Російська мова',
    image: 'Російська мова.jpg',
    authors: ['Ирина Лапшина', 'Н.Зорька'],
    path: 'Російська мова 4 клас Ирина Лапшина,Н.Зорька.pdf',
  },
  {
    name: 'Українська мова та читання (1 частина)',
    image: 'Українська мова та читання (1 частина).jpg',
    authors: ['М. Вашуленко', 'Н.Васильківська', 'С. Дубовик'],
    path: 'Українська мова та читання (1 частина) 4 клас М.Вашуленко,Н.Васильківська, С. Дубовик.pdf',
  },
  {
    name: 'Українська мова та читання (2 частина)',
    image: 'Українська мова та читання (2 частина).jpg',
    authors: ['О.Вашуленко'],
    path: 'Українська мова та читання (2 частина) 4 клас О.Вашуленко.pdf',
  },
  {
    name: 'Хрестоматія 3-4 клас',
    image: 'Хрестоматія 3-4 клас.webp',
    authors: [],
    path: 'Хрестоматія 3-4 клас.pdf',
  },
  {
    name: 'ЯДС',
    image: 'ЯДС.jpg',
    authors: ['Н.Бібік', 'Г.Бондарчук'],
    path: 'ЯДС (2 частина) 4 клас Н.Бібік, Г.Бондарчук.pdf',
  },
]
